# PRODUCT.md

## План документа

1. Главная идея
2. Главный пользовательский сценарий
3. Основные страницы
4. MVP
5. Версии

## 1. Главная идея проекта

Создать таск менеджер, который обеспечит исчерпывающий функционал и максималоьную "скорость" при взаимодействии.

Это значит что при в заимодействии с программой лично я и возможно несколько моих друзей, будут обладать всеми необходимыми инструментами для планирования и смогут максимально быстро пользоваться ими.

Основной проблемой в иных подобных сервисах вижу:

1. Функционал ограниченный рамками бесплатной подписки.
2. Перегруженный функционал и сложность в начальном освоении.
3. Отсутствие функционала который Я считаю необходимым и удобным.
4. Слишком "долгое" взаимодействие с программой, для того чтобы добавить задачу надо слишком много написать и покрутить.

## 2. Главный пользовательский сценарий

### 2.1. Главная страница

#### 2.1.1. Таймлайн / календарь

Пользователь видит таймлайн, например как в iCloud Calendar.

Тут все запланированные задачи расставлены по времени и дням.

Можно:

- установить напоминание;
- удалить событие;
- создать событие.

#### 2.1.2. Ежедневник

Пользователь попадает в свою "базу" задач.

Существуют категории и события.

Пример:
text
Категория: работа
Событие: созвон


Можно создавать категории.

Внутри категорий можно создавать события.

События можно перемещать между категориями.

Есть одна базовая категория:
text
unsorted


По умолчанию все события, созданные без категории, попадают в неё.

При создании категории надо указать:

- имя категории;
- цвет.

При создании события надо указать:

- имя события;
- категория.

В событии можно указать:

- описание;
- время начала + время конца;
- напоминание / уведомление;
- цикл повтора события;
- отдельная заметка.

По умолчанию событие создается в статусе:
text
Незапланированно


Событие можно "запланировать".

В таком случае нужно указать:

- время начала + время конца.
